[{
        "college": "Sardar Patel Institute of Technology",
        "location": "https://goo.gl/maps/bUCH1ZcvYF1XodTN9",
        "cutoff": "250",
        "fees": "1.8 lakh",
        "domain": "Engineering",
        "exam-type": ["cet"],
        "rank": "140",
        "placement": "100%",
        "ctc": "40 lakh",
        "intro": "The institute is located in 47 acres of green campus at Andheri (W), the fastest growing suburb of Mumbai. The campus also houses four Bhavan’s Institutions of great repute namely Bhavan’s College (the arts, commerce and science college), Sardar Patel College of Engineering – Government aided Engineering college, S.P. Jain Institute of Management and Research, a management institute and A.H. Wadia, higher secondary school.In 1957, the Bharatiya Vidya Bhavan conceived the idea of establishing an engineering college in Mumbai. Sardar Patel College of Engineering was inaugurated on 19th August 1962."
    },
    {
        "college": "Veermata Jijabai Technological Institute",
        "location": "https://goo.gl/maps/FuSp7GHcy9nGB1M67",
        "cutoff": "150",
        "fees": "1 lakh",
        "domain": "Engineering",
        "exam-type": ["cet"],
        "rank": "100",
        "placement": "99%",
        "ctc": "50 lakh",
        "intro": "VJTI Mumbai (estd. in 1887 as Victoria Jubilee Technical Institute) has pioneered India’s Engineering education, research and training ecosystem. Pre-independence, VJTI had been instrumental in driving industrial growth throughout united India. Post-independence, VJTI played a pivotal role in setting up IITs and RECs of India and strengthened technology excellence of country.In 1997, VJTI changed its name to Veermata Jijabai Technological Institute to honor mother of Chhatrapati Shivaji Maharaj."
    },
    {
        "college": "SVKM's Dwarkadas J. Sanghvi College of Engineering",
        "location": "https://goo.gl/maps/d6Jbe92xpYX4vs8K9",
        "cutoff": "500",
        "fees": "2 lakh",
        "domain": "Engineering",
        "exam-type": ["cet"],
        "rank": "200",
        "placement": "90%",
        "ctc": "20 lakh",
        "intro": "hri Vile Parle Kelavani Mandal’s (SVKM) Dwarkadas J. Sanghvi College of Engineering (DJSCE), was established in the year 1994. In the span of 27 years, DJSCE has come a long way and has made its impact felt not only in the country, but also abroad. DJSCE is an Autonomous Institution, granted autonomy by the University Grants Commission (UGC) for a period of 10 years, starting from the A.Y. 2019-20 till 2028-29. The National Assessment and Accreditation Council (NAAC) has accredited DJSCE with a CGPA of 3.18 out of 4, i.e., with an “A” Grade for a period of 5 years with effect from 18th of October 2019.The college runs 12 undergraduate programmes, 3 post graduate programmes and 3 Ph.D. courses for the A.Y. 2021-22, all permanently affiliated to the University of Mumbai. All the eligible undergraduate programs are accredited by the National Board of Accreditation."
    },
    {
        "college": "IIT Bombay",
        "location": "https://goo.gl/maps/tiMSgbcwLE2eYuWM7",
        "cutoff": "60",
        "fees": "2.5 lakh",
        "domain": "Engineering",
        "exam-type": ["jee"],
        "rank": "3",
        "placement": "100%",
        "ctc": "1 cr",
        "intro": "Established in 1958, the second of its kind, IIT Bombay was the first to be set up with foreign assistance. The funds from UNESCO came as Roubles from the then Soviet Union. In 1961 Parliament decreed the IITs as ‘Institutes of National Importance'. Since then, IITB has grown from strength to strength to emerge as one of the top technical universities in the world.The institute is recognised worldwide as a leader in the field of engineering education and research. Reputed for the outstanding calibre of students graduating from its undergraduate and postgraduate programmes, the institute attracts the best students from the country for its bachelor's, master's and doctoral programmes. Research and academic programmes at IIT Bombay are driven by an outstanding faculty, many of whom are reputed for their research contributions internationally."
    },
    {
        "college": "K. J. Somaiya College of Engineering",
        "location": "https://goo.gl/maps/PPZzvtFrXtGUZvJ28",
        "cutoff": "1000",
        "fees": "1.5 lakh",
        "domain": "Engineering",
        "exam-type": ["cet", "boards"],
        "rank": "250",
        "placement": "80%",
        "ctc": "15 lakh",
        "intro": "In just five decades it has grown into a large educational complex with 34 institutions catering to diverse fields of education such as Humanities, Engineering, Education, Medicine, Management, Pure Sciences and Mass Communication, with more than 39000+ Students and 3000+ Faculties and staff on a throbbing 65 acre campus!"
    },
    {
        "college": "Grant Medical College & Sir J. J. Group of Hospitals",
        "location": "https://goo.gl/maps/sTbs8y59J1dDP8Xo8",
        "cutoff": "400",
        "fees": "50 thousand",
        "domain": "Medical",
        "exam-type": ["neet"],
        "rank": "45",
        "placement": "90%",
        "ctc": "35 lakh",
        "intro": "Grant Medical College & Sir J. J. Group of Hospitals located near Byculla, was established in 1845. It is one of the oldest medical institutions which is run by the government of Maharashtra and provides medical training to the undergraduates and postgraduates. It has been consistently ranked among the top 10 medical colleges. The institute was ranked 11th among medical colleges in India by IndiaToday and 8th by The Week in 2020. The college accepts around 250 students annually for undergraduate degrees and around 100 students for various post graduation degrees."
    },
    {
        "college": "K.J. Somaiya Medical College & Research Centre",
        "location": "https://goo.gl/maps/HnR5mP6jFS6EqPNJ8",
        "cutoff": "900",
        "fees": "1.2 lakh",
        "domain": "Medical",
        "exam-type": ["neet"],
        "rank": "182",
        "placement": "100%",
        "ctc": "60 lakh",
        "intro": "The K. J. Somaiya Medical College is a Private Medical College owned and managed by the Somaiya Medical Trust and is situated in the Somaiya Ayurvihar Complex in the heart of city of Mumbai. The sapling of Medical College has grown over the years and now has a multitude of qualified and experienced teaching faculty and Resident Doctors working in 21 well equipped departments. The College runs an Undergraduate Program in Medical Sciences (MBBS) and Postgraduate Programs in Medical Broad specialities of Pediatrics (M.D.), Obstetrics and Gynaecology (M.S.) and Anatomy (M.D.) It is affiliated to ‘The Maharashtra University of Health Sciences (MUHS), Nashik."
    },
    {
        "college": "Lokmanya Tilak Municipal Medical College",
        "location": "https://goo.gl/maps/XwfZ1wJqqKzJgHJD6",
        "cutoff": "729",
        "fees": "70 thousand",
        "domain": "Medical",
        "exam-type": ["neet"],
        "rank": "269",
        "placement": "70%",
        "ctc": "20 lakh",
        "intro": "Lokmanya Tilak Municipal Medical College and General Hospital (LTMGH), as of today stands as one of the most reputed medical college and research institute in India. Abiding to our motto “Service through Excellence”"
    },
    {
        "college": "St. Xavier’s College",
        "location": "https://goo.gl/maps/QjYcRtmuQY3ZejKR8",
        "cutoff": "648",
        "fees": "1.6 lakh",
        "domain": ["Medical", "Engineering", "Arts", "Commerce"],
        "exam-type": ["cet", "boards", "neet"],
        "rank": "179",
        "placement": "85%",
        "ctc": "25 lakh",
        "intro": "St. Xavier’s College in Mumbai is a private roman catholic college affiliated with the University of Mumbai. The college has been ranked as India’s No.1 private autonomous college The college offers Undergraduate, Postgraduate, Certificate, and Diploma programs in the fields of Arts, Science, Business, and Commerce. Admission to these courses is both merit and entrance-based. The cut-off for the entrance exam conducted by the college ranges between 92-98 percentile for the general category students2021-22 by Education World for the second year in a row."
    },
    {
        "college": "Seth GS Medical College",
        "location": "https://goo.gl/maps/A9AUgaWKXQZTSx4D7",
        "cutoff": "1200",
        "fees": "2.1 lakh",
        "domain": "Medical",
        "exam-type": ["neet"],
        "rank": "223",
        "placement": "75%",
        "ctc": "10 lakh",
        "intro": "ounded in 1926, the Seth Gordhandas Sunderdas Medical College (GSMC) and the King Edward Memorial (KEM) Hospital are amongst the foremost teaching and medical care providing institutions in India. The medical college (school) provides training to about 2000 students in undergraduate, postgraduate and superspeciality medical courses; in undergraduate and postgraduate physical and occupational therapy; Masters and PhD courses in various allied specialties. A nursing school is also maintained by these institutions."
    },
    {
        "college": "Narsee Monjee College of Commerce and Economics",
        "location": "https://goo.gl/maps/AHCQ27cwCkEvHCzH8",
        "cutoff": "120",
        "fees": "2.4 lakh",
        "domain": "Commerce",
        "exam-type": ["boards"],
        "rank": "12",
        "placement": "100%",
        "ctc": "80 lakh",
        "intro": "Narsee Monjee College of Commerce and Economics (NMCCE), Mumbai was established in the year 1964 by Shri Vile Parle Kelavani Mandal (SVKM). The college is affiliated to the University of Mumbai and recognized by University Grants Commission (UGC). NMCCE has been re-accredited by NAAC with Grade ‘A’.At present, Narsee Monjee is offering various UG and PG courses in the field of Commerce and Economics. Admissions to all the UG and PG courses are purely based on merit as per the University of Mumbai guidelines. The college also offers certificate courses for working professional"
    },
    {
        "college": "H.R. College of Commerce & Economics",
        "location": "https://goo.gl/maps/1ojP9HD3wpCcre3r9",
        "cutoff": "487",
        "fees": "1.8 lakh",
        "domain": "Commerce",
        "exam-type": ["boards"],
        "rank": "59",
        "placement": "90%",
        "ctc": "29 lakh",
        "intro": "H.R. College of Commerce & Economics was established in the year 1960. The college is affiliated to the University of Mumbai and approved by the University Grants Commission (UGC). The College is accredited with Grade ‘A’ by NAAC and run by the Hyderabad Sind National Collegiate Board.At present, H.R. College is offering various UG, PG, and Doctoral courses in the field of Commerce and Economics. Admission to all the UG and PG courses are done on the basis of merit as per the Mumbai University guidelines, while Ph.D. admissions are based on entrance tests like PET/SET/NET/JRF followed by a personal interview. "
    },
    {
        "college": "KJ Somaiya College of Arts & Commerce",
        "location": "https://goo.gl/maps/Wu35dgVcdBk4XiHC8",
        "cutoff": "1500",
        "fees": "1.4 lakh",
        "domain": ["arts", "commerce"],
        "exam-type": ["boards", "cet"],
        "rank": "234",
        "placement": "80%",
        "ctc": "15 lakh",
        "intro": "JSAC (KJ Somaiya College of Arts & Commerce) is one of the premier institutions that was established in the year 1959. The college is affiliated to the University of Mumbai and recognized by UGC. It has also been credited NAAC Grade “A” and has over 50 years of excellence."
    },
    {
        "college": "K.P.B. Hinduja College of Commerce,",
        "location": "https://goo.gl/maps/Q5KZGd5dv4DYqLki9",
        "cutoff": "999",
        "fees": "1.2 lakh",
        "domain": "Commerce",
        "exam-type": ["boards"],
        "rank": "134",
        "placement": "87%",
        "ctc": "31 lakh",
        "intro": "K.P.B. Hinduja College of Commerce, founded in 1974 is one of the leading private/unaided colleges in the nation under the affiliation of Mumbai University. The Hinduja College of Commerce has been recently ranked at 77th by the prestigious rankings of India Today 2021 for Commerce and has received various awards and titles since its establishment. The college is awarded the “Coveted status” and UGC selected it as “College with Potential for Excellence”."
    },
    {
        "college": "Mithibai College of Arts, Chauhan Institute of Science and Amrutben Jivanlal College of Commerce and Economics",
        "location": "https://goo.gl/maps/kGM6DdvXEzWkYGFk6",
        "cutoff": "169",
        "fees": "2.3 lakh",
        "domain": ["commerce", "arts"],
        "exam-type": ["boards", "cet"],
        "rank": "35",
        "placement": "95%",
        "ctc": "69 lakh",
        "intro": "Mithibai College of Arts, Chauhan Institute of Science and Amrutben Jivanlal College of Commerce and Economics, located in Mumbai is popularly known as Mithibai College of Arts. The college is affiliated to the University of Mumbai and accredited grade “A” by the NAAC.At present, Mithibai College is offering UG and PG courses in the field of Arts, Science, and Commerce. It offers a doctoral-level course to offer Ph.D. degrees. Admissions to all the UG and PG courses are done purely on the basis of the merit list declared by the University of Mumbai. While candidates need to appear for an entrance test for Ph.D. admission. "
    },
    {
        "college": "NMIMS",
        "location": "https://goo.gl/maps/fLcpUwopNWdnAB3W6",
        "cutoff": "210",
        "fees": "1.27 lakh",
        "domain": "Law",
        "exam-type": ["cet"],
        "rank": "94",
        "placement": "90%",
        "ctc": "38.57 lakh",
        "intro": "Narsee Monjee Institute of Management Studies (NMIMS) is a private deemed-to-be university established in 1981 by the Shri Vile Parle Kelavani Mandal (SVKM). The School of Business Management (SBM), Mumbai is a part of the NMIMS Group and among the leading private B-schools in India. Accredited with the prominent AACSB, School of Business Management is a NAAC ‘A+’ Grade institution with a 3.59 score on a 4-point scale. Moreover, NMIMS SBM ranked 94 in ‘Top 100 Institutions in India’ by NIRF 2021."
    },
    {
        "college": "KC Law College",
        "location": "https://goo.gl/maps/m4FNyiqW3UsKmrxX6",
        "cutoff": "114",
        "fees": "80 thousand",
        "domain": "Law",
        "exam-type": ["cet"],
        "rank": "239",
        "placement": "80%",
        "ctc": "15 lakh",
        "intro": "Kishinchand Chellaram Law College, popularly known as KC Law College, is a law institution located at Churchgate, Mumbai. The institution was established in 1955 by Hyderabad (Sind) National Collegiate Board (HSNC Board). It is affiliated with the University of Mumbai. The college is located in the same campus as Kishinchand Chellaram College and the H.R. College of Commerce and Economics."
    },
    {
        "college": "DY Patil Law of College",
        "location": "https://goo.gl/maps/MEvGLrV1tJFD5kUn8",
        "cutoff": "116",
        "fees": "3 lakh",
        "domain": "Law",
        "exam-type": ["cet", "boards"],
        "rank": "179",
        "placement": "89%",
        "ctc": "23 lakh",
        "intro": "DY Patil School of Law was established in 2002 in Navi Mumbai, Maharashtra. It offers courses such as BCom LLB, BA LLB, and LLB. Recognised by BCI and UGC, the Institute offers sports recreations to its students at Dr DY Patil Sport Academy situated in the campus. The College is a constituent unit of Dr DY Patil Vidyapeeth (Deemed to be University). The University received ‘A’ Grade accreditation from NAAC."
    },
    {
        "college": "Lords' Universal College of Law",
        "location": "https://goo.gl/maps/BLZqDxbS6tW3ACKYA",
        "cutoff": "229",
        "fees": "41.5 thousand",
        "domain": "Law",
        "exam-type": ["cet"],
        "rank": "174",
        "placement": "92%",
        "ctc": "23.5 lakh",
        "intro": "Lords Universal College of Law popularly known as LUC LAW is one of the leading colleges of excellence in the Mumbai Western Suburbs, located at a convenient location at Goregaon West. It is afﬁliated to University of Mumbai and recognized by the Bar Council of India. LUC LAW is Permanently Unaided and Recognized as Gujarati Linguistic Minority Institution. Established in the year 2006 by Vidya Vikas Education Trust, it has since been imparting quality legal education. It prides itself in having excellent infrastructure and experience faculty."
    },
    {
        "college": "SVKM's Pravin Gandhi College of Law, Mumbai",
        "location": "https://goo.gl/maps/eVmWNDZxbiiumGUt8",
        "cutoff": "269",
        "fees": "3.3 lakh",
        "domain": "Law",
        "exam-type": ["cet"],
        "rank": "177",
        "placement": "87%",
        "ctc": "18 lakh",
        "intro": "SVKM's Pravin Gandhi College of Law, Mumbai was established in 2004. It is approved by the Bar Council of India and is affiliated to the University of Mumbai. The College offers a five-year integrated Bachelor of Legal Science & Bachelor of Legislative Law (B.L.S., LL.B) program. Admission to the college is based on scores obtained in MH CET Law exam. The law college also has a Training & Placement Cell which provides its students with employment opportunities in renowned law firms and corporate companies."
    },
    {
        "college": "Jai Hind College",
        "location": "https://goo.gl/maps/QNFwy6TYx43JX12UA",
        "cutoff": "1392",
        "fees": "1.65 lakh",
        "domain": "Arts",
        "exam-type": ["cet", "boards"],
        "rank": "267",
        "placement": "75%",
        "ctc": "11 lakh",
        "intro": "Jai Hind College, established in 1948, is an autonomous college located in Mumbai and affiliated with the University of Mumbai. It is a junior college as well as a regular degree college. The college offers all three subject streams of Science, Commerce, and Arts for 12th grade and offers 12 undergraduate programs, 5 postgraduate programs, 1 Research program and 25 Certificate/Skill development/Value-added Courses, and also several self-financed and vocational courses to improve the employability of the students"
    },
    {
        "college": "Sir J.J.Institute of Applied Art",
        "location": "https://goo.gl/maps/p1xZdsCnjXEkCTiz7",
        "cutoff": "753",
        "fees": "1.3 lakh",
        "domain": "Arts",
        "exam-type": ["cet", "boards"],
        "rank": "213",
        "placement": "80%",
        "ctc": "15 lakh"
    },
    {
        "college": "S K Somaiya Degree College of Arts, Science and Commerce",
        "location": "https://goo.gl/maps/4vToqJXU88vEBZFz7",
        "cutoff": "1600",
        "fees": "99 thousand",
        "domain": ["arts", "commerce"],
        "exam-type": ["nmat"],
        "rank": "192",
        "placement": "82%",
        "ctc": "13 lakh"
    },
    {
        "college": "Ramnarain Ruia Autonomous College",
        "location": "https://goo.gl/maps/ks7pGpyppE64HAjh6",
        "cutoff": "1190",
        "fees": "1.4 lakh",
        "domain": "Arts",
        "exam-type": ["cet"],
        "rank": "251",
        "placement": "79%",
        "ctc": "9 lakh",
        "intro": "Ramnarain Ruia Autonomous College was established in the year 1937 by the Shikshana Prasaraka Mandali, in Mumbai, Maharashtra. The college is recognized by UGC and affiliated to the University of Mumbai. It has been re-accredited with grade A by NAAC in 2017..At present, Ramnarian Ruia is offering Undergraduate, Postgraduate, and doctoral programs in the field of Arts and science. Admissions are purely based on merit as per the directions issued by the University of Mumbai. For admission to Ph.D., candidates are required to appear for an entrance examination conducted by the college."
    }
]